$(document).ready(function() {
	com.resize();
	com.map();
	com.tab();
})
var com = {
	info: [
		["思明区营业部", "厦门市思明区鹭江道96号106-107单元", "2028518", "24.46282,118.079862", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["育秀支行", "厦门市思明区育秀里66-67号", "2298656", "24.492254,118.121257", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["美仁宫支行", "厦门市后江埭路37号美仁宫邮政大楼", "2208171", "24.471849,118.100062", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["富山支行", "厦门市厦禾路993号之104-105", "5800269", "24.479631,118.126019", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"],
		["金榜支行", "厦门市厦禾路869号", "5162329", "24.473363,118.11451", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["瑞景支行", "厦门市莲前东路636号", "5928107", "24.480675,118.169182", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["观音山支行", "厦门市思明区半屏山路1274-1290偶数号店面", "5162673", "24.502724,118.199595", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["分行营业部", "厦门市思明区莲岳路1号磐基中心商务楼二楼西北区、六、七、十九楼", "2629333", "24.488738,118.127503", "个人业务：周一至周五9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["新华路支行", "厦门市新华路52号", "2028671", "24.462719,118.09148", "个人业务：9:00-17:00"], //√
		["湖滨南支行", "厦门市湖滨南路180号", "2209126", "24.476753,118.10525", "个人业务：9:00-17:00"], //√
		["槟榔支行", "厦门市思明区湖滨六里152号", "2961366", "24.484731,118.121949", "个人业务：9:00-17:00"], //√
		["厦大支行", "厦门市顶沃仔12号", "2086656", "24.445723,118.099215", "个人业务：9:00-17:00"], //√
		["曾厝垵支行", "厦门市思明区龙虎山路386号101、102、103单元", "2510094", "24.438396,118.128812", "个人业务：9:00-17:00"], //√
		["湖滨北支行", "厦门市思明区湖滨北路109-111号底层03-04室", "5114782", "24.486911,118.100566", "个人业务：9:00-17:00"], //√
		["莲花支行", "厦门市莲花玉亭里43号", "5534964", "24.492952,118.139456", "个人业务：9:00-17:00"], //√
		["梧村支行", "厦门市湖滨东路6号华龙大厦一层右侧", "5807403", "24.476368,118.120837", "个人业务：9:00-17:00"], //√
		["松柏支行", "厦门市仙岳路458号松柏邮政大厦一楼西北侧", "5201661", "24.500819,118.125165", "个人业务：9:00-17:00"], //√
		["莲前东营业所", "厦门市莲前东路891号1楼", "5927995", "24.478341,118.178264", "个人业务：9:00-17:00"], //√
		["厦禾营业所", "厦门市厦禾路415－419光明大厦一楼", "2204148", "24.46826,118.092915", "个人业务：9:00-17:00"], //√
		["龙盛里营业所", "厦门市龙华路14号", "5558086", "24.494509,118.144892", "个人业务：9:00-17:00"], //√
		["东浦营业所", "厦门市思明区东浦路68号之144单元", "5968805", "24.477466,118.1334", "个人业务：9:00-17:00"], //√
		["前埔东营业所", "厦门市前埔东路574号", "5915378", "24.484523,118.184987", "个人业务：9:00-17:00"], //√
		["文园营业所", "厦门市文园路65号", "2912908", "24.468084,118.108203", "个人业务：9:00-17:00"], //√
		["莲前西营业所", "厦门市莲前西路989号", "5997628", "24.482866,118.158019", "个人业务：9:00-17:00"], //√
		//24个
		["湖里区营业部", "厦门市吕岭路21号吕岭邮电大楼", "5518891", "24.497761,118.137196", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["高殿支行", "厦门市湖里区殿前一路289号高殿大厦一、二层", "5627074", "24.533412,118.112667", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["马垄支行", "厦门市悦华路151号", "5650859", "24.521176,118.120243", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["湖边支行", "厦门市枋湖东路268号", "5734479", "24.515881,118.161432", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["嘉禾支行", "厦门市嘉禾路390号", "5214492", "24.502537,118.133723", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["机场支行", "厦门市湖里区金尚路2588、2590号", "5712610", "24.53415,118.144654", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["禾山支行", "厦门市湖里区禾山路505号之六、七、八", "5512109", "24.511265,118.141018", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["万达支行", "厦门市湖里区金钟路1号144-147单元", "5771753", "24.511265,118.141018", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["金尚支行", "厦门市湖里区金尚路146号", "5516310", "24.497268,118.15321", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["祥店营业所", "厦门市湖里区祥店里182号", "2066850", "24.506705,118.15031", "个人业务：9:00-17:00"], //√
		["高崎营业所", "厦门市湖里区高崎北二路68号A幢场所", "5740880", "24.549428,118.124938", "个人业务：9:00-17:00"], //√
		["火炬营业所", "厦门市火炬路10号", "5711994", "24.519015,118.129997", "个人业务：9:00-17:00"], //√
		["塘边营业所", "厦门市兴隆路265号北侧", "5639370", "24.513809,118.121237", "个人业务：9:00-17:00"], //√
		["东渡支行", "厦门市东渡路71号", "6017190", "24.490295,118.085701", "个人业务：9:00-17:00"], //√
		["金山营业所", "厦门市金山西里11号之14-15东侧", "5223554", "24.50572,118.164311", "个人业务：9:00-17:00"], //√
		["寨上营业所", "厦门市湖里区寨上2213号底层", "5600884", "24.526526,118.107403", "个人业务：9:00-17:00"], //√
		["海天营业所", "厦门市湖里区海天路98号之三", "6022908", "24.510543,118.107566", "个人业务：9:00-17:00"], //√
		//41个
		["杏林支行", "厦门市集美区杏东路19号第一层01单元", "6078195", "24.569903,118.053065", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["集美区营业部", "厦门市集美区石鼓路136号", "6068259", "24.581411,118.106525", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["灌口支行", "厦门市集美区灌口镇凤泉东里21-23号", "6092929", "24.613295,117.998465", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["杏北支行", "厦门市集美区杏林北二路89号一层101、二层201", "6226573", "24.587675,118.04686", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["后溪营业所", "厦门市集美区后溪镇仑上村", "6260270", "24.631495,118.05623", "个人业务：9:00-17:00"], //√
		["杏南营业所", "厦门市集美区杏南路45号104室", "6213090", "24.565255,118.047487", "个人业务：9:00-17:00"], //√
		["集灌营业所", "厦门市集美区灌口镇安仁大道560-564号一楼", "6315679", "24.611892,118.003151", "个人业务：9:00-17:00"], //√
		["新村营业所", "厦门市集美区后溪镇后溪大道400号之24-26店面", "6367901", "24.646445,118.032287", "每天9:00-17:00"], //√
		["集北营业所", "厦门市集美区天安路37-39号1-2店面", "6100070", "24.600067,118.111043", "个人业务：9:00-17:00"], //√
		["马銮营业所", "厦门市集美区马銮路7号农贸市场综合楼一楼", "6378729", "24.569929,118.035476", "每天9:00-17:00"], //√
		//51个
		["翔安区营业部", "厦门市翔安区马巷镇巷东路318号一层", "7063044", "24.668651,118.264238", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["新圩支行", "厦门市翔安区新圩镇山岬路1号", "7070001", "24.744869,118.265771", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["开发新区支行", "厦门市翔安区春江里58号101店面", "7291195", "24.638676,118.254698", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["新店支行", "厦门市翔安区新店村永兴路266号之三", "7081464", "24.612831,118.252271", "个人业务：9:00-17:00"], //√
		["莲河营业所", "厦门市翔安区新店镇莲河村小学路6号", "7081781", "24.591877,118.352972", "个人业务：9:00-17:00"], //√
		["大嶝营业所", "厦门市翔安区大嶝环嶝北路25号", "7090000", "24.570406,118.342222", "个人业务：9:00-17:00"], //√
		["马巷营业所", "厦门市翔安区马巷镇巷西路265号一楼", "7622168", "24.674176,118.25426", "个人业务：9:00-17:00"], //√
		["黎林营业所", "厦门市翔安区黎林路854号", "7067168", "24.651155,118.247002", "个人业务：9:00-17:00"], //????????
		["刘五店营业所", "厦门市翔安区新店镇刘五店村电信楼一楼", "7800536", "24.577379,118.208097", "每天9:00-17:00"], //√
		["内厝营业所", "厦门市翔安区内厝镇上塘村蔡厝口满源楼一楼", "7097080", "24.671279,118.278543", "每天9:00-17:00"], //√
		//61个
		["南门支行", "厦门市同安区环城北路140号、市场路2号", "7023226", "24.739644,118.152354", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["同安区营业部", "厦门市同安区城南路299号", "7020424", "24.726433,118.15422", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["株厝支行", "厦门市同安工业集中区梧侣路西湖珠厝里150-152号", "7257529", "24.694119,118.14053", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["西柯支行", "厦门市同安区西柯镇西福路7号一层", "7115663", "24.670756,118.146158", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["凤南营业所", "厦门市同安区凤南农场大埔村南国路185号西侧", "7058414", "24.694743,118.085709", "个人业务：9:00-17:00"], //√
		["美埔营业所", "厦门市同安区莲花镇美埔村邮电大楼东侧", "7050000", "24.751888,118.072494", "个人业务：9:00-17:00"], //√
		["潘涂营业所", "厦门市同安区西柯镇潘涂村红墩里60号", "7011164", "24.649759,118.146398", "个人业务：9:00-17:00"], //√
		["城北营业所", "厦门市同安区东山路48、50号", "7226237", "24.74348,118.156938", "个人业务：9:00-17:00"], //√
		["大同营业所", "厦门市同安区大同街道同新路58号一楼", "7055076", "24.734177,118.158729", "个人业务：9:00-17:00"], //√
		["新民营业所", "厦门市同安区新民镇梧侣村金包银下社区域5-6店面", "7237339", "24.700732,118.126402", "每天9:00-17:00"], //√
		["阳翟营业所", "厦门市同安区祥平街道阳翟路2770号一楼大门厅店面", "7052953", "24.712611,118.159465", "个人业务：9:00-17:00"], //√
		["五显营业所", "厦门市同安区五显镇安炉村五显里4-5号（2#公寓楼）之8-9店面", "7301869", "24.747888,118.172962", "每天9:00-17:00"], //√
		//73个
		["海沧区营业部", "厦门市海沧区海富路250号", "6051283", "24.499677,118.042473", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["嵩屿支行", "厦门市海沧区嵩屿南二路80号", "6059102", "24.459847,118.044766", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["海虹支行", "厦门市海沧区沧湖东一里368-373号", "2629373", "24.495206,118.0562", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["霞阳支行", "厦门市海沧区霞阳社区霞光外口公寓B1—B2号店面", "6510015", "24.537185,118.026941", "个人业务：9:00-17:00；对公业务：周一-周五9:00-17:00"], //√
		["东孚支行", "厦门市海沧区东孚镇莲花村389号", "6310773", "24.561178,117.937133", "个人业务：9:00-17:00"], //√
		["新阳营业所", "厦门市海沧区新垵村南片109号", "6512871", "24.526465,118.003101", "个人业务：9:00-17:00"], //√
		["兴港营业所", "厦门市海沧区兴港六里177号-178号之13-16店面", "6895193", "24.476385,118.035576", "每天9:00-17:00"], //√
		["鼓浪湾营业所", "厦门市海沧区滨湖路1904号", "6535614", "24.493843,118.051244", "个人业务：9:00-17:00"], //√
		//81个
	],
	resize: function() {
		var winWidth = $(window).width();
		var winHeight = $(window).height();
		var docWidth = winWidth > 640 ? 640 : winWidth;
		var mainbody = $("div").is(".mainbody");
		var heightbody = $("div").is(".heightbody");
		if (mainbody) {
			$(".mainbody").css({
				"width": docWidth,
				"height": "auto"
			});
		} else if (heightbody) {
			$(".heightbody").css({
				"width": docWidth,
				"height": "auto"
			});
		}
	},
	map: function() {
		var wrap = $(".wrap");
		var sum = "";
		var a = 0;
		var b = 0;
		for (var j = 0; j < 6; j++) {
			switch (j) {
				case 0:
					a = 0, b = 24;
					break;
				case 1:
					a = 24, b = 41;
					break;
				case 2:
					a = 41, b = 51;
					break;
				case 3:
					a = 51, b = 61;
					break;
				case 4:
					a = 61, b = 73;
					break;
				case 5:
					a = 73, b = 81;
					break;
			}
			sum += "<div class='content'>";
			for (var i = a; i < b; i++) {
				sum += "<section>";
				sum += "<div class='top'>";
				sum += "<span>" + this.info[i][0] + "</span>";
				sum += "</div>";
				sum += "<div class='bottom'>";
				sum += "<p>网点地址：" + this.info[i][1] + "</p>";
				sum += "<p>营业时间：" + this.info[i][4] + "</p>"
				sum += "<p>联系电话：0592-" + this.info[i][2] + "</p>";
				sum += "</div>";
				sum += "<div class='btn clearfix'>";
				sum += "<img class='left' src='style/images/tel.png' onclick='go(&quot;tel://0592-" + this.info[i][2] + "&quot;)'/>";
				sum += "<img class='right' src='style/images/map.png' onclick='go(&quot;http://api.map.baidu.com/marker?v=" + (new Date().getTime()) + "&location=" + this.info[i][3] + "&title=" + this.info[i][0] + "&content=" + this.info[i][1] + "&output=html&quot;)'/>";
				sum += "</div>";
				sum += "<img src='style/images/lt.png'/>";
				sum += "</section>";
			}
			sum += "</div>";
		}
		wrap.html(sum);
	},
	tab: function() {
		var select = $("select");
		var content = $(".content");
		select.change(function() {
			var a = $(this).val();
			content.eq(a).show().siblings().hide();
		});
	}
}